<a href="https://colab.research.google.com/github/harikosaraju9/Data_612_assignments/blob/main/Week_2_Assignment_Data_Mining612_Hari_Kosaraju.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

###Read Input file

In [ ]:
df = pd.read_csv("State_Drug_Utilization_Data_2010_Hari.csv")

In [ ]:
df.head()

   Unnamed: 0 Utilization Type  ...             Location          NDC
0      128037             FFSU  ...  (35.5376, -96.9247)  50458055101
1      491755             FFSU  ...  (40.3363, -89.0022)    378261010
2     2568076             FFSU  ...   (18.2766, -66.335)  50242006201
3      491263             FFSU  ...  (44.0407, -72.7093)     93738201
4      836489             MCOU  ...  (43.3504, -84.5603)    904198359

[5 rows x 21 columns]

###Input dataset information

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156219 entries, 0 to 156218
Data columns (total 21 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   Unnamed: 0                      156219 non-null  int64
 1   Utilization Type                156219 non-null  object
 2   State                           156219 non-null  object
 3   Labeler Code                    156219 non-null  int64
 4   Product Code                    156219 non-null  int64
 5   Package Size                    156219 non-null  int64
 6   Year                            156219 non-null  int64
 7   Quarter                         156219 non-null  int64
 8   Product Name                    156192 non-null  object
 9   Units Reimbursed                77002 non-null   float64
 10  Suppression Used                156219 non-null  bool
 11  Number of Prescriptions         77002 non-null   float64
 12  Total Amount Reimbursed         77002 non-null   float64
 13  Medicaid Amount Reimbursed      77002 non-null   float64
 14  Non Medicaid Amount Reimbursed  77002 non-null   float64
 15  Quarter Begin                   156219 non-null  object
 16  Quarter Begin Date              156219 non-null  object
 17  Latitude                        145178 non-null  float64
 18  Longitude                       145178 non-null  float64
 19  Location                        145178 non-null  object
 20  NDC                             156219 non-null  int64
dtypes: bool(1), float64(7), int64(7), object(6)
memory usage: 24.0+ MB

###Finding Max date from the colum 'Quarter Begin Date'.

In [ ]:
df["Quarter Begin Date"].max()

'10/01/2010'

In [ ]:
df["Quarter Begin Date"].min()

'01/01/2010'

###Convert 'Quarter Begin Date' which is type 'object' to datetimestamp type. and save it to new column 'date_dt'.

In [ ]:
df['date_dt'] = pd.to_datetime(df['Quarter Begin Date'])

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156219 entries, 0 to 156218
Data columns (total 22 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   Unnamed: 0                      156219 non-null  int64
 1   Utilization Type                156219 non-null  object
 2   State                           156219 non-null  object
 3   Labeler Code                    156219 non-null  int64
 4   Product Code                    156219 non-null  int64
 5   Package Size                    156219 non-null  int64
 6   Year                            156219 non-null  int64
 7   Quarter                         156219 non-null  int64
 8   Product Name                    156192 non-null  object
 9   Units Reimbursed                77002 non-null   float64
 10  Suppression Used                156219 non-null  bool
 11  Number of Prescriptions         77002 non-null   float64
 12  Total Amount Reimbursed         77002 non-null   float64
 13  Medicaid Amount Reimbursed      77002 non-null   float64
 14  Non Medicaid Amount Reimbursed  77002 non-null   float64
 15  Quarter Begin                   156219 non-null  object
 16  Quarter Begin Date              156219 non-null  object
 17  Latitude                        145178 non-null  float64
 18  Longitude                       145178 non-null  float64
 19  Location                        145178 non-null  object
 20  NDC                             156219 non-null  int64
 21  date_dt                         156219 non-null  datetime64[ns]
dtypes: bool(1), datetime64[ns](1), float64(7), int64(7), object(6)
memory usage: 25.2+ MB

In [ ]:
df.head()

   Unnamed: 0 Utilization Type  ...          NDC    date_dt
0      128037             FFSU  ...  50458055101 2010-04-01
1      491755             FFSU  ...    378261010 2010-04-01
2     2568076             FFSU  ...  50242006201 2010-04-01
3      491263             FFSU  ...     93738201 2010-07-01
4      836489             MCOU  ...    904198359 2010-01-01

[5 rows x 22 columns]

In [ ]:
df["date_dt"].max()

Timestamp('2010-10-01 00:00:00')

In [ ]:
df["date_dt"].min()

Timestamp('2010-01-01 00:00:00')

###Get number of days by subtracting each date in the column 'Quarter Begin Date' from max date in the column

In [ ]:
y =df["date_dt"].max() - df["date_dt"]

In [ ]:
y.head()

0   183 days
1   183 days
2   183 days
3    92 days
4   273 days
Name: date_dt, dtype: timedelta64[ns]

###Convert number of days to months

In [ ]:
df['months'] = ((df["date_dt"].max() - df["date_dt"])/np.timedelta64(1, 'M'))

In [ ]:
df['months'] = df['months'].astype(int)

In [ ]:
df.head()

   Unnamed: 0 Utilization Type State  ...          NDC    date_dt  months
0      128037             FFSU    PA  ...  50458055101 2010-04-01       6
1      491755             FFSU    IN  ...    378261010 2010-04-01       6
2     2568076             FFSU    SD  ...  50242006201 2010-04-01       6
3      491263             FFSU    WY  ...     93738201 2010-07-01       3
4      836489             MCOU    MN  ...    904198359 2010-01-01       8

[5 rows x 23 columns]

###Write to a dataset

In [ ]:
df.to_csv('State_Drug_Utilization_Data_2010_week_2.csv')